//M909381A JOB (HST,02,LYE),'BITACORA BATCH',
//         CLASS=1,
//         MSGLEVEL=(1,1),
//   MSGCLASS=L,REGION=0M
//PROCLIB JCLLIB ORDER=SYS3.IOAI.V630.MEXD.TGT.PROCLIB
//IOAENV  INCLUDE MEMBER=IOASET
//PASO1   EXEC PROC=CTMAESIM,RDR=INTRDR
//DASUBMIT DD SYSOUT=*
//DASIM    DD *
ODATE   111221
MEMBER  B1IOALOG
LIBRARY M909381.JCL.CNTL
SUBSCAN
/*
